IlleniumDillon/MM32LLD/MM32/Sfr/MM32_SDIOReg.h
#ifndef _MM32_SDIOREG_H_
#define _MM32_SDIOREG_H_

#include "MM32_RegBase.h"

#include "MM32_SDIORegDef.h"

#define MOUDLE_SDIO		((MM32_SDIO*)SDIO_BASE)

#define SDIO_CTRL		((MM32_SDIO_CTRL*)(SDIO_BASE+0X00))

#define SDIO_IO		((MM32_SDIO_IO*)(SDIO_BASE+0X04))

#define SDIO_BYTECNT		((MM32_SDIO_BYTECNT*)(SDIO_BASE+0X08))

#define SDIO_TRBLOCKCNT		((MM32_SDIO_TRBLOCKCNT*)(SDIO_BASE+0X0C))

#define SDIO_CRCCTL		((MM32_SDIO_CRCCTL*)(SDIO_BASE+0X10))

#define SDIO_CMDCRC		((MM32_SDIO_CMDCRC*)(SDIO_BASE+0X14))

#define SDIO_DATCRC		((MM32_SDIO_DATCRC*)(SDIO_BASE+0X18))

#define SDIO_PORT		((MM32_SDIO_PORT*)(SDIO_BASE+0X20))

#define SDIO_INTEN		((MM32_SDIO_INTEN*)(SDIO_BASE+0X24))

#define SDIO_INTSTA		((MM32_SDIO_INTSTA*)(SDIO_BASE+0X28))

#define SDIO_CARDSEL		((MM32_SDIO_CARDSEL*)(SDIO_BASE+0X2C))

#define SDIO_SIG		((MM32_SDIO_SIG*)(SDIO_BASE+0X30))

#define SDIO_IOMBCTL		((MM32_SDIO_IOMBCTL*)(SDIO_BASE+0X34))

#define SDIO_BLOCKCNT		((MM32_SDIO_BLOCKCNT*)(SDIO_BASE+0X38))

#define SDIO_TIMEOUTCNT		((MM32_SDIO_TIMEOUTCNT*)(SDIO_BASE+0X3C))

#define SDIO_CMDBUF0		((MM32_SDIO_CMDBUF0*)(SDIO_BASE+0X40))

#define SDIO_CMDBUF1		((MM32_SDIO_CMDBUF1*)(SDIO_BASE+0X44))

#define SDIO_CMDBUF2		((MM32_SDIO_CMDBUF2*)(SDIO_BASE+0X48))

#define SDIO_CMDBUF3		((MM32_SDIO_CMDBUF3*)(SDIO_BASE+0X4C))

#define SDIO_CMDBUF4		((MM32_SDIO_CMDBUF4*)(SDIO_BASE+0X50))

#define SDIO_CMDBUF5		((MM32_SDIO_CMDBUF5*)(SDIO_BASE+0X54))

#define SDIO_CMDBUF6		((MM32_SDIO_CMDBUF6*)(SDIO_BASE+0X58))

#define SDIO_CMDBUF7		((MM32_SDIO_CMDBUF7*)(SDIO_BASE+0X5C))

#define SDIO_CMDBUF8		((MM32_SDIO_CMDBUF8*)(SDIO_BASE+0X60))

#define SDIO_CMDBUF9		((MM32_SDIO_CMDBUF9*)(SDIO_BASE+0X64))

#define SDIO_CMDBUF10		((MM32_SDIO_CMDBUF10*)(SDIO_BASE+0X68))

#define SDIO_CMDBUF11		((MM32_SDIO_CMDBUF11*)(SDIO_BASE+0X6C))

#define SDIO_CMDBUF12		((MM32_SDIO_CMDBUF12*)(SDIO_BASE+0X70))

#define SDIO_CMDBUF13		((MM32_SDIO_CMDBUF13*)(SDIO_BASE+0X74))

#define SDIO_CMDBUF14		((MM32_SDIO_CMDBUF14*)(SDIO_BASE+0X78))

#define SDIO_CMDBUF15		((MM32_SDIO_CMDBUF15*)(SDIO_BASE+0X7C))

#define SDIO_BUFCTL		((MM32_SDIO_BUFCTL*)(SDIO_BASE+0X80))

#define SDIO_DATABUF		((uint32_t*)(SDIO_BASE+0X100))

#endif
